=================================================
scalar declaration
=================================================

my $a;

---

(source_file
  (variable_declaration (scope) (single_var_declaration
    (scalar_variable)
  ) )
)


=================================================
scalar declaration with initialization
=================================================

my $a = 3;

---

(source_file
  (variable_declaration (scope) (single_var_declaration
    (scalar_variable)) (integer) )
)

=================================================
multi declaration with initialization
=================================================

my ($self, $args) = @_;

---

(source_file
  (variable_declaration (scope)
    (multi_var_declaration
      (variable_declarator (scalar_variable)) (variable_declarator (scalar_variable))
    ) (special_variable) 
  )
)

=================================================
array declaration
=================================================

my @array;

---

(source_file
  (variable_declaration (scope) (single_var_declaration
    (array_variable)
  ) )
)

=================================================
array declaration with initialization
=================================================

my @array = ('meow', 'woof', 'burp');

---

(source_file
  (variable_declaration (scope) (single_var_declaration
    (array_variable)) (array (string_single_quoted) (string_single_quoted) (string_single_quoted)) )
)

=================================================
hash ref with initialization
=================================================

my $hash = {
  'cat' => 'meow',
  "cow" => 'moo',
  dog => 'woof',
};

---

(source_file
  (variable_declaration (scope) (single_var_declaration (scalar_variable))
    (hash_ref
      (string_single_quoted) (hash_arrow_operator) (string_single_quoted)
      (string_double_quoted) (hash_arrow_operator) (string_single_quoted)
      (bareword) (hash_arrow_operator) (string_single_quoted))
    ))

=================================================
use statement
=================================================

use Data::Dumper;

---

(source_file
  (use_no_statement (package_name (identifier) (identifier)) )
)

=================================================
no statement
=================================================

no strict 'refs';

---

(source_file
  (use_no_statement (package_name (identifier)) (string_single_quoted) )
)

=================================================
require statement
=================================================

require Data::Dumper;

---

(source_file
  (require_statement (package_name (identifier) (identifier)) )
)

=================================================
single line comment
=================================================

# this is a single line comment

---

(source_file
  (comments)
)

=================================================
length of an array
=================================================

$#array;

---

(source_file
  (scalar_variable) 
)

=================================================
Double quoted string with escape sequence
=================================================

"this is a string \n in next line at the end";

---

(source_file
  (string_double_quoted (escape_sequence)) 
)

=================================================
<STDIN>
=================================================

while (<>) {}
my $fh = \*STDIN;
my $line = <$fh>;

---

(source_file
  (while_statement (empty_parenthesized_expression (standard_input))
    (block)
  )
  (variable_declaration (scope) (single_var_declaration (scalar_variable)) (standard_input) )
  (variable_declaration (scope) (single_var_declaration (scalar_variable)) (standard_input_to_variable (scalar_variable)) )
)
